import React from "react";

const ColorSchemeHelp = () => {


    return (
        <div>
            <div className="component-help">
                <div className="videoHelp">
                    <iframe width="480" height="300" src="https://www.youtube.com/embed/cKaRxd6tdHY"
                        title="YouTube video player" frameborder="0"
                        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen>
                    </iframe>
                </div>
                <div className="header">
                    <h2>Що таке колірна модель?</h2>
                </div>
                <p className="text">Колірна модель — абстрактна модель опису представлення кольорів у вигляді кортежів (наборів) чисел, зазвичай з трьох або чотирьох значень, званих колірними компонентами або колірними координатами. Разом з методом інтерпретації цих даних (наприклад, визначення умов відтворення та / або перегляду — тобто завдання способу реалізації), множина кольорів колірної моделі визначає колірний простір.

                    Також під колірною моделлю необхідно розуміти спосіб відображення колірної гами в дискретному вигляді, для представлення її в обчислювальних, цифрових системах.
                </p>
                <div className="header">
                    <h2>Колірні моделі:</h2>
                </div>
                <div className="header">
                    <h3>RGB</h3>
                </div>
                <p className="textRef">Детальніше про RGB: <a href="https://uk.wikipedia.org/wiki/RGB" target="_blank" rel="noopener noreferrer">https://uk.wikipedia.org/wiki/RGB</a></p>
                <p className="text">
                    RGB (скорочено від англ. Red, Green, Blue — червоний, зелений, синій) — адитивна колірна модель, що описує спосіб синтезу кольору, за якою червоне, зелене та синє світло накладаються разом, змішуючись у різноманітні кольори. Широко застосовується в техніці, що відтворює зображення за допомогою випромінення світла.
                </p>
                <img src="../images/rgb.png" alt="RGB Cube" />
                <p className="text">
                    Адитивна модель кольору найпростіша для розуміння. Вона є досить штучним прийомом, оскільки
                    продиктована технологією виготовлення електронно-променевих трубок. Це апаратно-орієнтована модель, в якій
                    кольори описуються за допомогою складання трьох базових кольорів – червоного, зеленого, синього – в різних
                    пропорціях. Тому модель RGB називають адитивною (від англ. «add» складати, додавати). Кольори також називають
                    колірними каналами моделі RGB.
                </p>
                <p className="text">
                    Кожен з базових кольорів може приймати інтенсивність (насиченість) у діапазоні від 0 до 255. Повна кількість
                    кольорів, які представляються цією моделлю, дорівнює 256?256?256 = 16 777 216. За допомогою моделі RGB
                    описуються кольори, що отримуються змішуванням світлових променів. Дану модель використовують монітори,
                    телевізори, сканери, слайд-проектори, кольорові лампи реклами і інші пристрої, в яких колір виходить шляхом
                    змішування світлових пучків. Вона також використовується для опису кольорів на сторінках Інтернету в спеціальному
                    шістнадцятковому вигляді (#RRGGBB).
                </p>
                <p className="text">
                    Змінюючи інтенсивність свічення кольорових крапок, можна створити велике різноманіття відтінків. Якщо
                    інтенсивність кожного з них максимальна (255), то виходить білий колір. Відсутність всіх трьох кольорів дає чорний
                    колір. Якщо змішуються всі кольори з однаковою інтенсивністю (але не максимальною і не мінімальною), отримуємо
                    сірий колір.
                </p>
                <div className="header">
                    <h3>HSV</h3>
                </div>
                <p className="textRef">Детальніше про HSV: <a href="https://uk.wikipedia.org/wiki/HSV" target="_blank" rel="noopener noreferrer">https://uk.wikipedia.org/wiki/HSV</a></p>
                <p className="text">
                    HSV (також HSB) — колірна модель, заснована на трьох характеристиках кольору: колірному тоні (Hue), насиченості (Saturation) і значенні кольору (Value), який також називають яскравістю (Brightness).
                </p>
                <img src="../images/hsvpyr.png" alt="HSV Pyr" />
                <img src="../images/hsv.png" alt="HSV Scale" />
                <p className="text">
                    Hue — колірний тон, (наприклад, червоний, зелений або синьо-блакитний). Варіюється в межах 0-360°, але іноді приводиться до діапазону 0-100 або 0-1. У Windows весь колірний спектр ділиться на 240 відтінків (що можна спостерігати в редакторі палітри MS Paint), тобто тут «Hue» зводиться до діапазону 0-239 (відтінок 240 відсутній, оскільки він дублював би 0).
                </p>
                <p className="text">
                    Saturation — насиченість. Варіюється в межах 0-100 або 0-1. Чим більший цей параметр, тим «чистіший» колір, тому цей параметр іноді називають чистотою кольору. А чим ближчий цей параметр до нуля, тим ближчий колір до нейтрального сірого.
                </p>
                <p className="text">
                    Value — значення кольору, або Brightness — яскравість. Також задається в межах 0-100 або 0-1. Ми сприймаємо значення кольору на основі кількості світла, відбитого від поверхні та поглиненого людським оком. Ми називаємо інтенсивність світла, яке досягає ока, «яскравістю».
                </p>
                <p className="text">
                    Модель була створена Елві Реєм Смітом, одним із засновників Pixar, в 1978 році. Вона є нелінійним перетворенням моделі RGB.

                    Колір, представлений в HSV, залежить від пристрою, на який він буде виведений, оскільки HSV — перетворення моделі RGB, яка теж залежить від пристрою. Для отримання коду кольору, не залежного від пристрою, використовується модель Lab.

                    Слід зазначити, що HSV (HSB) і HSL — дві різні колірні моделі.
                </p>
                <div className="header">
                    <h3>CMYK</h3>
                </div>
                <p className="textRef">Детальніше про CMYK: <a href="https://uk.wikipedia.org/wiki/CMYK" target="_blank" rel="noopener noreferrer">https://uk.wikipedia.org/wiki/CMYK</a></p>
                <p className="text">
                    CMYK (скорочено від англ. Cyan, Magenta, Yellow, BlacK color) — субтрактивна колірна модель, використовується у поліграфії, перш за все при багатофарбовому (повноколірному) друці. Вона застосовується у друкарських машинах і кольорових принтерах.

                    Українською перші три кольори називають так: блакитний, пурпуровий, жовтий; але професіонали мають на увазі ціан, маджента та жовтий. Ці кольори візуально не ідентичні із загальноприйнятими назвами кольорів. Так, маджента — це лише один з пурпурових відтінків; жовтий і блакитний — абсолютно певні відтінки, а не цілі діапазони, як у веселці.
                </p>
                <img src="../images/cmyk.png" alt="CMYK Cube" />
                <p className="text">
                    Базовими кольорами моделі CMY є кольори, які виходять у результаті віднімання основних кольорів RGB від
                    білого. Звідси назва моделі субтрактивна (від англ. «to subtract» – віднімати). Базові кольори моделі CMY:</p>
                <p className="innerP"> C (CYAN) – блакитний = білий - червоний = зелений + синій;</p>
                <p className="innerP"> M (MAGENTA) – пурпурний = білий - зелений = червоний + синій;</p>
                <p className="innerP"> Y (YELLOW) – жовтий = білий - синій = червоний + зелений.</p>
                <p className="text">
                    Наприклад, коли на поверхню паперу нанести блакитний (cyan) колір, тоді червоне світло, що падає на папір,
                    повністю поглинатиметься. Отже, блакитна фарба, так би мовити, віднімає червоний колір від білого, який є сумою
                    червоного, зеленого і синього кольорів, тобто відбивається лише зелена та синя складові світла, що і дає блакитний
                    колір. Аналогічно жовта фарба (Yellow) поглинає синій колір, а пурпурна (Мagenta) – зелений. Білий папір виглядає
                    білим тому, що він відбиває всі кольори і жоден не поглинає.
                </p>
                <p className="text">
                    Згідно з теорією кольору, практично будь-який відтінок можна отримати за допомогою лише трьох кольорів — наприклад Cyan, Magenta і Yellow. Зокрема чорний колір — змішуванням згаданих кольорів в рівній пропорції і з максимальною інтенсивністю. На практиці через недосконалості пігментації фарб стовідсоткове змішування цих трьох кольорів дає скоріше брудно-коричневий або брудно-сірий колір; тріадні фарби не дають тієї глибини і насиченості, яка досягається використанням чорної фарби. Оскільки чистота і насиченість чорного кольору є надзвичайно важливою в друкарському процесі, його було введено в цю колірну модель.

                    Так було зроблено ще і на користь зручності і простоти друку одноколірних об'єктів — наприклад, чорного тексту. Крім очевидної безглуздості і марнотратства друку кольору, що часто зустрічається, трьома (дорогими) фарбами замість однієї (дешевої сажі), виникають ще і чисто технологічні проблеми — неприведення (незбіг накладених кольорів, що на малих кеглях дає абсолютно нечитабельний результат), і багато інших.
                </p>
            </div>
        </div>
    );
};

export default ColorSchemeHelp;