import React from "react";

const FractalHelp = () => {


    return (
        <div>
            <div className="component-help">
                <div className="videoHelp">
                    <iframe width="480" height="300" src="https://www.youtube.com/embed/DHNooAe44dY"
                        title="YouTube video player" frameborder="0"
                        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                        allowfullscreen>
                    </iframe>
                </div>
                <div className="header">
                    <h2>Що таке фрактал?</h2>
                </div>
                <p className="text">Поняття фрактал і фрактальна геометрія, що з’явилися в кінці 70-х, із середини 80-х міцно увійшли до
                    ужитку математиків і програмістів. Слово фрактал утворено від латинського “fractus”, що в перекладі означає
                    “той, що складається з фрагментів”. Воно було запропоноване Бенуа Мандельбротом у 1975 році для
                    позначення нерегулярних, але самоподібних структур, якими він займався. Народження фрактальної геометрії
                    прийнято пов’язувати з виходом у 1977 році книги Мандельброта “The Fractal Geometry of Nature”. У його
                    роботах використані наукові результати інших учених, що працювали в період 1875–1925 років у тій же
                    області (Пуанкаре, Фату, Жюліа, Кантор, Хаусдорф). Але тільки у наш час вдалося об’єднати їхні роботи в єдину
                    систему.
                </p>
                <p className="text">
                    Роль фракталів в комп’ютерній графіці сьогодні велика. Вони приходять на допомогу, наприклад, коли
                    потрібно за допомогою декількох коефіцієнтів задати лінії і поверхні дуже складної форми. З погляду
                    комп’ютерної графіки, фрактальна геометрія незамінна під час генерації штучних хмар, гір, поверхні морів.
                    Фактично знайдено спосіб легкого представлення складних об’єктів, які схожі на природні.
                </p>
                <p className="text">
                    Однією з основних властивостей фракталів є самоподібність. У найпростішому випадку невелика частина
                    фрактала містить інформацію про весь фрактал.
                </p>
                <p className="text">
                    Визначення фрактала, дане Мандельбротом, звучить так: “Фракталом називається структура, що
                    складається з частин, які в якомусь сенсі подібні до цілого”.
                </p>

                <div className="types">
                    <div className="header">
                        <h2>Класифікація фракталів</h2>
                    </div>
                    <p className="miniHeader">Існують такі види фракталів:<br /></p>
                    <p className="innerP"> 1) геометричні,<br /> </p>
                    <p className="innerP">2) алгебраїчні,<br /></p>
                    <p className="innerP">3) стохастичні,<br /></p>
                    <p className="innerP">4) системи ітеруючих функцій.</p>
                    <div className="header">
                        <h3>Геометричні фрактали</h3>
                    </div>
                    <p className="text">
                        Фрактали цього класу найнаочніші. Цей тип фракталів утворюється шляхом простих геометричних
                        побудов. Наприклад, у двомірному випадку їх отримують за допомогою деякої ламаної (або поверхні в
                        тривимірному випадку), званої генератором. За один крок алгоритму кожен з відрізків (складових ламаної)
                        замінюється на ламану-генератор, у відповідному масштабі. У результаті нескінченного повторення цієї
                        процедури, виходить геометричний фрактал.
                    </p>
                    <p className="text">
                        Перші ідеї фрактальної геометрії виникли в ХІХ ст. Кантор за допомогою простої рекурсивної процедури
                        перетворив лінію на набір незв’язаних крапок (так званий Пил Кантора). Він брав лінію і видаляв центральну
                        третину, після цього повторював те ж саме з відрізками.
                    </p>
                    <div className="header">
                        <h3>Алгебраїчні фрактали</h3>
                    </div>
                    <p className="text">
                        Це найбільша група фракталів. Отримують їх за допомогою нелінійних процесів в n-мірних просторах.
                        Найбільше вивчені двомірні процеси. Інтерпретуючи нелінійний ітераційний процес, як дискретну динамічну
                        систему, можна користуватися термінологією теорії цих систем: фазовий портрет, сталий процес,
                        аттрактор і т.д.
                    </p>
                    <p className="text">
                        Відомо, що нелінійні динамічні системи володіють декількома стійкими станами. Той стан, в якому
                        опинилася динамічна система після деякого числа ітерацій, залежить від її початкового стану. Тому кожен
                        стійкий стан (або як говорять – аттрактор) володіє деякою областю початкових станів, з яких система
                        обов’язково потрапить в дані кінцеві стани. Таким чином, фазовий простір системи розбивається на області
                        тяжіння аттракторів. Якщо фазовим є двомірний простір, то забарвлюючи області тяжіння різними
                        кольорами, можна отримати колірний фазовий портрет цієї системи (ітераційного процесу). Міняючи
                        алгоритм вибору кольору, можна отримати складні фрактальні картини з химерними багатоколірними
                        узорами. Несподіванкою для математиків стала можливість за допомогою примітивних алгоритмів
                        породжувати дуже складні нетривіальні структури.
                    </p>
                    <div className="header">
                        <h3>Стохастичні фрактали</h3>
                    </div>
                    <p className="text">
                        Ще одним відомим класом фракталів є стохастичні фрактали, які виходять в тому випадку, якщо коли в ітераційному процесі випадковим чином міняти які-небудь його параметри. При цьому утворюються об’єкти дуже схожі на природні – несиметричні дерева, порізані берегові лінії і так далі Двовимірні стохастичні фрактали використовуються при моделюванні рельєфу місцевості і поверхні моря. У зв’язку з цим двовимірні стохастичні фрактали дуже часто використовуються під час моделювання різних природних об’єктів: рельєфу місцевості, поверхні моря тощо.
                    </p>
                    <div className="header">
                        <h3>Системи ітеруючих функцій</h3>
                    </div>
                    <p className="text">
                        Ця група фракталів набула широкого поширення завдяки роботам Майкла Барнслі з технологічного інституту штату Джорджія. Він намагавсякодувати зображення за допомогою фракталів. Запатентувавши декілька ідей по кодуванню зображень за допомогою фракталів, він заснував фірму «Iterated Systems», яка через деякий час випустила перший продукт «Images Incorporated», в якому можна було зображення переводити з растрової форми у фрактальну FIF.
                        Це дозволяло добитися високих ступенів стиснення. При низьких ступенях стиснення якість малюнків поступалася якості формату JPEG, але при високих картинки виходили якіснішими. У будь-якому випадку цей формат не прижився, але роботи по його удосконаленню ведуться до цих пір. Адже цей формат не залежить від роздільної здатності зображення. Оскільки зображення закодоване за допомогою формул, то його можна збільшити до будь-яких розмірів і при цьому з’являтимуться нові деталі, а не просто збільшиться розмір пікселів.
                    </p>
                </div>

                <div className="header">
                    <h2>Деякі з фракталів</h2>
                </div>
                <div className="header">
                    <h3>Плазма</h3>
                </div>
                <p className="header">
                    Плазма – найвідоміший стохастичний фрактал:
                </p>
                <img src="../images/frac.png" alt="Plasma" width={450} height={240} />
                <div className="header">Покроковий алгоритм побудови:</div>
                <p className="innerP"> 1. Нехай потрібно заповнити плазмою квадрат точок.<br /> </p>
                <p className="innerP">2. Задається яким-небудь чином, наприклад, випадково, кольори кутів квадрата.<br /></p>
                <p className="innerP">3. Визначається колір середини кожної сторони як середнє між кольорами інцидентних їй вершин плюс /
                    мінус деяка випадкова величина.<br /></p>
                <p className="innerP">4. Визначається колір центру квадрата як середнє між кутами плюс / мінус деяка випадкова величина.<br /></p>
                <p className="innerP">5. Виходить 4 квадрати із заданими вершинами – для кожного з них повторюється алгоритм з третього кроку.<br /></p>

                <p className="innerP">
                    Розмах випадкової величини має залежати від розміру квадрата – чим менший квадрат, тим менше відхилення
                </p>
                <div className="header">
                    <h3>Броунівський рух</h3>
                </div>
                <img src="../images/brown.png" alt="BrownianMotion" width={450} height={240} />
                <p className="innerP">
                    Броунівський рух – це хаотичний рух зважених в газі або рідини частинок, яке відбувається при дії поштовхів молекул навколишнього середовища.
                    Цей рух був відкритий ботаніком Робертом Броуном (1827), а після них описано в 1828 р.
                </p>
            </div>
        </div>
    );
};

export default FractalHelp;